# CanAddBarGeometry Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarTrimExtendData..::..CanAddBarGeometry Method
RebarTrimExtendData Class See Also
---
Returns true if getNumberOfBarGeometry() is less than GetNumberOfBars(), false otherwise.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool CanAddBarGeometry()
```

Visual Basic
---
```text
Public Function CanAddBarGeometry As Boolean
```

Visual C++
---
```text
public:
bool CanAddBarGeometry()
```

# See Also
RebarTrimExtendData Class
Autodesk.Revit.DB.Structure Namespace